# -*- coding: utf-8 -*-
"""
Created on Sat Sep 19 14:39:49 2020

@author: USER
"""

i = int(input("請輸入利潤: ")) #利用input函數讀入數字再用int函數轉成整數
if i<=100000 : #利用if elif else 來算出每個範圍的獎金總數並存在n
    n=i*0.1
elif 100000<i<=200000:
    n=10000+((i-100000)*0.075)
elif 20000<i<=400000 :
    n=10000+7500+((i-200000)*0.05)
elif 400000<i<=600000:
    n=10000+7500+10000+((i-400000)*0.03)
elif 60000<i<=1000000:
    n=10000+7500+10000+6000+((i-600000)*0.015)
else:
    n=10000+7500+10000+6000+6000+((i-1000000)*0.01)
print('獎金總數=',n) #印出獎金總數